Joins ans Merges in Pandas
- Inner (default merge)
- Left (default join)
- Right 
- Outer

In [9]:
import pandas as pd

In [10]:
df1 = pd.DataFrame({"id": [1, 2, 3, 4,7], "Name": ["Alice", "Bob", "Charlie", "David","Fredd"]})

In [11]:
df2 = pd.DataFrame({"id": [1, 2, 3, 4,5], "Age": [21, 27, 15, 32,67]})

In [12]:
df1.merge(df2)

   id     Name  Age
0   1    Alice   21
1   2      Bob   27
2   3  Charlie   15
3   4    David   32

In [13]:
df1.merge(df2,on='id',how='inner')

   id     Name  Age
0   1    Alice   21
1   2      Bob   27
2   3  Charlie   15
3   4    David   32

In [14]:
df1.merge(df2, on="id", how="outer")

   id     Name   Age
0   1    Alice  21.0
1   2      Bob  27.0
2   3  Charlie  15.0
3   4    David  32.0
4   5      NaN  67.0
5   7    Fredd   NaN

In [15]:
df1.merge(df2, on="id", how="right")

   id     Name  Age
0   1    Alice   21
1   2      Bob   27
2   3  Charlie   15
3   4    David   32
4   5      NaN   67

In [16]:
df1.merge(df2, on="id", how="left")

   id     Name   Age
0   1    Alice  21.0
1   2      Bob  27.0
2   3  Charlie  15.0
3   4    David  32.0
4   7    Fredd   NaN

In [20]:
# we need index'es for join
df1.set_index('id',inplace=True)
df2.set_index('id',inplace=True)

In [ ]:
df1.join(df2, on='id', how='inner')

       Name  Age
id
1     Alice   21
2       Bob   27
3   Charlie   15
4     David   32

In [24]:
df1.join(df2, how='inner')

       Name  Age
id
1     Alice   21
2       Bob   27
3   Charlie   15
4     David   32

In [22]:
df1.join(df2)

       Name   Age
id
1     Alice  21.0
2       Bob  27.0
3   Charlie  15.0
4     David  32.0
7     Fredd   NaN

In [27]:
pd.concat([df1, df2])

       Name   Age
id
1     Alice   NaN
2       Bob   NaN
3   Charlie   NaN
4     David   NaN
7     Fredd   NaN
1       NaN  21.0
2       NaN  27.0
3       NaN  15.0
4       NaN  32.0
5       NaN  67.0

In [28]:
pd.concat([df1, df2],axis=1)

       Name   Age
id
1     Alice  21.0
2       Bob  27.0
3   Charlie  15.0
4     David  32.0
7     Fredd   NaN
5       NaN  67.0

In [34]:
lis = [1,2]
round(sum(lis)/len(lis),2)

1.5

In [35]:
pd.Series(lis)

0    1
1    2
dtype: int64